app/services/project.rb

INSERT INTO "organisations" ("name", "number_of_users", "subscription_id", "number_of_boards", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "sample"], ["number_of_users", 2], ["subscription_id", 2], ["number_of_boards", -1], ["created_at", "2020-04-09 08:28:50.200598"], ["updated_at", "2020-04-09 08:28:50.200598"]]
---
  def self.create params
  	@organisation = Organisation.create(org_params(params))

INSERT INTO "users" ("email", "encrypted_password", "created_at", "updated_at", "name", "organisation_id", "normal_user") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def self.create params, organisation_id
  	params[:user][:organisation_id] = organisation_id
  	@user = User.new user_params(params)
  	@user.save