lib/tasks/subscriptions.rake

  task add_values: :environment do
  	@subscription = Subscription.create(:title => "test")
---
INSERT INTO "subscriptions" ("title", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["title", "test"], ["created_at", "2020-04-06 05:10:55.510660"], ["updated_at", "2020-04-06 05:10:55.510660"]]