app/views/organisations/plan_choice.html.erb

SELECT  "organisations".* FROM "organisations" WHERE "organisations"."id" = $1 LIMIT $2  [["id", 13], ["LIMIT", 1]]
SELECT "subscriptions".* FROM "subscriptions"
---

    <% first = current_user.organisation.subscription || @subscriptions.first %>