app/helpers/application_helper.rb

SELECT COUNT(*) FROM "boards" WHERE "boards"."organisation_id" = $1  [["organisation_id", 8]]
---
    def boards_within_limit?
    	@organisation = current_user.organisation
		(@organisation.number_of_boards == -1) || (@organisation.number_of_boards > @organisation.boards.size)