app/helpers/cards_helper.rb

SELECT "tasks".* FROM "tasks" WHERE "tasks"."card_id" = $1 ORDER BY "tasks"."id" ASC  [["card_id", 28]]
---
  def border_color card
    if card.tasks.blank?