app/controllers/application_controller.rb

SELECT  "organisations".* FROM "organisations" WHERE "organisations"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
	def check_org
	 	if current_user.organisation_id.blank?
    		redirect_to alter_organisations_url
    	elsif current_user.organisation.subscription_id.blank?

SELECT COUNT(*) FROM "users" WHERE "users"."organisation_id" = $1  [["organisation_id", 3]]
---
	def users_within_limit?
		@organisation = current_user.organisation
		@organisation.number_of_users > @organisation.users.size

SELECT COUNT(*) FROM "boards" WHERE "boards"."organisation_id" = $1  [["organisation_id", 8]]
---
    def boards_within_limit?
    	@organisation = current_user.organisation
		 (@organisation.number_of_boards == -1) || (@organisation.number_of_boards > @organisation.boards.size)