app/controllers/boards_controller.rb

  def create
    @board = Board.new(board_params)

    respond_to do |format|
      if @board.save
---
INSERT INTO "boards" ("title", "organisation_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "b3"], ["organisation_id", 8], ["user_id", 16], ["created_at", "2020-04-07 05:25:03.865607"], ["updated_at", "2020-04-07 05:25:03.865607"]]

    def set_board
      @board = Board.find(params[:id])
---
SELECT  "boards".* FROM "boards" WHERE "boards"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]