app/controllers/cards_controller.rb

SELECT "cards".* FROM "cards" WHERE "cards"."board_id" = $1 AND "cards"."parent_id" = $2  [["board_id", 4], ["parent_id", ""]]
---
  def index
    @cards = @board.cards.where(parent_id: '')

SELECT "cards".* FROM "cards" WHERE "cards"."board_id" = $1  [["board_id", 6]]
---
  def new
    @cards = @board.cards.collect {|s| [s.title, s.id]}

INSERT INTO "cards" ("title", "description", "parent_id", "board_id", "created_by", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["title", "AA"], ["description", ""], ["parent_id", ""], ["board_id", 6], ["created_by", 21], ["created_at", "2020-04-08 09:53:39.566608"], ["updated_at", "2020-04-08 09:53:39.566608"]]
---
  def create
    params[:card][:created_by] = current_user.id
    @card = @board.cards.new(card_params)

    respond_to do |format|
      if @card.save

SELECT  "cards".* FROM "cards" WHERE "cards"."id" = $1 LIMIT $2  [["id", 28], ["LIMIT", 1]]
---
  def get_children
    @parent = Card.find(params[:parent])

SELECT  "boards".* FROM "boards" WHERE "boards"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
---
    def set_board
      @board = Board.find(params[:board_id])