app/controllers/cards_controller.rb

  def destroy
    unless @card.tasks.size > 0 || @card.children.size > 0
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."card_id" = $1 ORDER BY "tasks"."id" ASC  [["card_id", 31]]

    def set_card
      @card = Card.find(params[:id])
---
SELECT  "cards".* FROM "cards" WHERE "cards"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]