app/controllers/organisations_controller.rb

	def create
		@organisation = Organisation.new(organisations_params)
	    respond_to do |format|
	      if @organisation.save
	      	if current_user.present?
	      		current_user.organisation_id = @organisation.id
	      		current_user.save
---
INSERT INTO "organisations" ("name", "location", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", ""], ["location", ""], ["created_at", "2020-04-06 12:47:43.548675"], ["updated_at", "2020-04-06 12:47:43.548675"]]
INSERT INTO "users" ("organisation_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["organisation_id", 1], ["created_at", "2020-04-06 04:46:27.771182"], ["updated_at", "2020-04-06 04:46:27.771182"]]
UPDATE "organisations" SET "number_of_boards" = $1, "updated_at" = $2 WHERE "organisations"."id" = $3  [["number_of_boards", 5], ["updated_at", "2020-04-06 08:06:15.725314"], ["id", 13]]
UPDATE "users" SET "organisation_id" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["organisation_id", 2], ["updated_at", "2020-04-06 12:53:55.599676"], ["id", 1]]

	def plan_choice
		@subscriptions = Subscription.all#.collect {|s| [s.title, s.id]}
---
SELECT "subscriptions".* FROM "subscriptions"

	def subscribed
    	@organisation = current_user.organisation
        if @organisation.update(subscribe_params)
---
UPDATE "organisations" SET "subscription_id" = $1, "number_of_boards" = $2, "number_of_users" = $3, "updated_at" = $4 WHERE "organisations"."id" = $5  [["subscription_id", 2], ["number_of_boards", -1], ["number_of_users", 10], ["updated_at", "2020-04-06 13:02:50.613884"], ["id", 2]]