app/controllers/subscriptions_controller.rb

SELECT  "subscriptions".* FROM "subscriptions" WHERE "subscriptions"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
  def details
  	@subscription = Subscription.find(params[:id])