app/controllers/tasks_controller.rb

INSERT INTO "tasks" ("title", "card_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "c3"], ["card_id", 31], ["created_at", "2020-04-08 06:22:08.875625"], ["updated_at", "2020-04-08 06:22:08.875625"]]
---
  def create
    @task = @card.tasks.new(task_params)

    respond_to do |format|
      if @task.save

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 ORDER BY "tasks"."id" ASC LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "tasks" SET "completed" = $1, "updated_at" = $2 WHERE "tasks"."id" = $3  [["completed", false], ["updated_at", "2020-04-08 05:47:03.472231"], ["id", 3]]
---
  def change
    @task = Task.find(params[:id])
    @task.update(completed: params[:completed])

SELECT  "cards".* FROM "cards" WHERE "cards"."id" = $1 LIMIT $2  [["id", 29], ["LIMIT", 1]]
---
  def set_card
    @card = Card.find(params[:card_id])