app/controllers/users_controller.rb

  def add
    if users_within_limit?
      params[:organisation_id] = current_user.organisation_id
      params[:normal_user] = true
      @user = User.new(user_params)
      respond_to do |format|
        if @user.save
---
INSERT INTO "users" ("email", "encrypted_password", "created_at", "updated_at", "organisation_id", "normal_user") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"