app/models/bill.rb

SELECT  "subscriptions".* FROM "subscriptions" WHERE "subscriptions"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
	def initialize params
		@number_of_users = params[:number_of_users].to_i
		@number_of_boards = params[:number_of_boards].to_i
		@subscription = Subscription.find(params[:id])