app/models/card.rb

  def tasks_completed?
  	self.tasks.size == self.tasks.completed_are.size
---
SELECT COUNT(*) FROM "tasks" WHERE "tasks"."card_id" = $1 AND "tasks"."completed" = $2  [["card_id", 28], ["completed", true]]

  def self.competed_cards
  	self.all.reject{|card| card unless card.tasks_completed? && !card.tasks.blank? }
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."card_id" = $1 ORDER BY "tasks"."id" ASC  [["card_id", 28]]

  def self.uncompleted_cards
  	self.all.reject{|card| card unless !card.tasks_completed? && !card.tasks.blank? }
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."card_id" = $1 ORDER BY "tasks"."id" ASC  [["card_id", 29]]