app/views/layouts/application.html.erb


<% if !current_user.blank? && !current_user.organisation.blank? %>
---
SELECT  "organisations".* FROM "organisations" WHERE "organisations"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]